


my_tuple = (1, 2, [30, 40])
my_tuple[2].append(1)
print(my_tuple)

'''
my_list = [1, 2, 3]
print(my_list)
# >>> [1, 2, 3]
print(id(my_list))
# >>> 139885024492288

# Т.к. список изменяемый, то id остался тем же
my_list *= 2
print(my_list)
# >>> [1, 2, 3, 1, 2, 3]
print(id(my_list))
# >>> 139885024492288


my_tuple = (1, 2, 3)
print(my_tuple)
# >>> (1, 2, 3)
print(id(my_tuple))
# >>> 140166121328384

# Т.к. кортеж не изменяем, то создался новый объект
my_tuple *= 2
print(my_tuple)
# >>> (1, 2, 3, 1, 2, 3)
print(id(my_tuple))
# >>> 140166121042272
'''

'''
# Не правильно т.к. в таком случае список будет иметь 
board = [['_'] * 3] * 3
print(board)
# >>> [['_', '_', '_'], ['_', '_', '_'], ['_', '_', '_']]

board[1][2] = 'O'
print(board)
# >>> [['_', '_', 'O'], ['_', '_', 'O'], ['_', '_', 'O']]
'''

'''
board = [['_'] * 3 for _ in range(3)]
print(board)
# >>> [['_', '_', '_'], ['_', '_', '_'], ['_', '_', '_']]

board[1][2] = 'X'
print(board)
# >>> [['_', '_', '_'], ['_', '_', 'X'], ['_', '_', '_']]

'''
